

namespace ET.Client
{
    /// <summary>
    /// 发行区划
    /// 分为发行板块和发行区域,比如东亚就是一个板块,中国大陆是东亚板块的一个发行区域
    /// </summary>
    public enum EnumOfDistributionArea
    {

        东亚发行=0,

        大简中区,
        维吾尔区,
        藏区,
        香港,
        澳门,
        台湾,
        日本,
        韩国,
        朝鲜,
        蒙古,

        东南亚发行 = 100,

        马来西亚,
        印尼,
        越南,
        菲律宾,
        泰国,
        新加坡,

        西亚四个主力市场 = 200,

        土耳其,
        沙特,
        阿联酋,
        埃及,

        西亚发展中市场 =300,

        伊朗, 伊拉克, 以色列, 约旦, 科威特, 巴林,
        黎巴嫩, 阿曼, 卡塔尔, 叙利亚, 也门, 巴勒斯坦, 苏丹, 
        毛里塔尼亚, 索马里,


        马格里布地区发行 = 400,

        阿尔及利亚,
        利比亚,
        摩洛哥,
        突尼斯,

        撒哈拉以南主要市场 = 500,

        尼日利亚, 南非, 肯尼亚, 埃塞俄比亚,
        加纳, 科特迪瓦, 安哥拉, 坦桑尼亚, 喀麦隆, 乌干达,

        南亚发行 = 600,

        印度,
        巴基斯坦,
        阿富汗,
        孟加拉国,
        不丹,
        马尔代夫,
        尼泊尔,
        斯里兰卡,

        中亚五国发行 = 700,

        哈萨克斯坦,
        吉尔吉斯斯坦,
        塔吉克斯坦,
        土库曼斯坦,
        乌兹别克斯坦,

        北美发行 = 800,

        美国联邦,
        加拿大,

        太平洋发行 = 900,

        澳大利亚,
        新西兰,
        美国夏威夷州,
        斐济,
        萨摩亚,汤加,巴布亚新几内亚,瓦努阿图,密克罗尼西亚联邦,所罗门群岛,基里巴斯,
        瑙鲁,图瓦卢,马绍尔群岛,帕劳,库克群岛,纽埃,法属波利尼西亚,法属新喀里多尼亚,

        加勒比地区发行 = 1000,

        墨西哥, 哥伦比亚,
        古巴,安提瓜和巴布达, 巴哈马, 巴巴多斯,伯利兹,哥斯达黎加,
        多米尼克, 多米尼加,萨尔瓦多,格林纳达,危地马拉,圭亚那,海地,洪都拉斯,
        牙买加,尼加拉瓜,巴拿马,圣基茨和尼维斯,圣文森特和格林纳丁斯,圣卢西亚,
        苏里南, 特立尼达和多巴哥双岛,

        南美发行 =1100,

        巴西,
        阿根廷,
        智利,
        秘鲁,
        委内瑞拉,
        厄瓜多尔,
        玻利维亚,
        巴拉圭,
        乌拉圭,
        法属圭亚那,
        福克兰群岛,

        北欧五国发行 = 1200,

        丹麦,
        芬兰,
        冰岛,
        挪威,
        瑞典,

        斯拉夫地区发行 = 1300,

        俄罗斯,
        白俄罗斯,
        乌克兰,

        东欧发行 = 1400,

        波兰,
        立陶宛,
        爱沙尼亚,
        拉脱维亚,
        捷克,
        斯洛伐克,
        匈牙利,
        克罗利亚,

        地中海欧洲发行 = 1500,

        意大利,
        西班牙,
        葡萄牙,
        希腊,
        马耳他,
        塞浦路斯,

        巴尔干地区发行 = 1600,

        安道尔,梵蒂冈,圣马力诺,斯洛文尼亚,克罗地亚,阿尔巴尼亚,罗马尼亚,
        保加利亚,塞尔维亚,黑山,北马其顿,波斯尼亚和黑塞哥维那,

        西欧发行 = 1700,

        法国,
        德国,
        奥地利,
        荷兰,
        瑞士,
        比利时,
        卢森堡,
        列支敦士登, 
        摩纳哥, 

        英伦地区发行 = 1800,

        英格兰,
        苏格兰,
        爱尔兰,

        特殊发行版本 = 1900,

        零号,
        壹号,
        贰号,
        叁号,
    }
}